betaflight/betaflight/src/platform/STM32/startup/stm32c5xx_hal2_compat.h
/**
  ******************************************************************************
  * @file    stm32c5xx_hal2_compat.h
  * @brief   Compatibility shims mapping old STM32 HAL/LL API names used by
  *          Betaflight to the new HAL2 (Cube 2.0) equivalents in STM32CubeC5.
  *
  *          Include this header AFTER the device and HAL headers.
  ******************************************************************************
  */

#ifndef STM32C5XX_HAL2_COMPAT_H
#define STM32C5XX_HAL2_COMPAT_H

/* --------------------------------------------------------------------------
 * Register-access macros: HAL2 renamed SET_BIT → STM32_SET_BIT, etc.
 * Betaflight (and CMSIS HAL1) code uses the short names everywhere.
 * -------------------------------------------------------------------------- */
#ifndef SET_BIT
#define SET_BIT     STM32_SET_BIT
#endif
#ifndef CLEAR_BIT
#define CLEAR_BIT   STM32_CLEAR_BIT
#endif
#ifndef READ_BIT
#define READ_BIT    STM32_READ_BIT
#endif
#ifndef WRITE_REG
#define WRITE_REG   STM32_WRITE_REG
#endif
#ifndef READ_REG
#define READ_REG    STM32_READ_REG
#endif
#ifndef MODIFY_REG
#define MODIFY_REG  STM32_MODIFY_REG
#endif

/* --------------------------------------------------------------------------
 * HAL status type: HAL2 uses hal_status_t, old code uses HAL_StatusTypeDef
 * -------------------------------------------------------------------------- */
typedef hal_status_t HAL_StatusTypeDef;

/* --------------------------------------------------------------------------
 * FunctionalState: removed in HAL2 CMSIS.  Many Betaflight platform files
 * and the old LL drivers depend on this enum.
 * -------------------------------------------------------------------------- */
#ifndef __FUNCTIONALSTATE_DEFINED
#define __FUNCTIONALSTATE_DEFINED
typedef enum {
    DISABLE = 0U,
    ENABLE  = !DISABLE
} FunctionalState;
#endif

/* --------------------------------------------------------------------------
 * FLASH_PAGE_SIZE: HAL2 defines this in the flash header; Betaflight also
 * defines it in target.h.  Undefine the HAL version so ours takes precedence.
 * -------------------------------------------------------------------------- */
#ifdef FLASH_PAGE_SIZE
#undef FLASH_PAGE_SIZE
#endif

/* --------------------------------------------------------------------------
 * GPIO mode/speed/pull constants: HAL2 renames all GPIO constants.
 * Betaflight's IO_CONFIG packing encodes mode in bits 0-1, otype in bit 4,
 * speed in bits 2-3, pull in bits 5-6.  These values match LL register fields.
 * -------------------------------------------------------------------------- */
#define GPIO_MODE_INPUT       0x00U
#define GPIO_MODE_OUTPUT_PP   0x01U
#define GPIO_MODE_OUTPUT_OD   0x11U
#define GPIO_MODE_AF_PP       0x02U
#define GPIO_MODE_AF_OD       0x12U
#define GPIO_MODE_ANALOG      0x03U

#define GPIO_NOPULL           0x00U
#define GPIO_PULLUP           0x01U
#define GPIO_PULLDOWN         0x02U

#define GPIO_SPEED_FREQ_LOW        0x00U
#define GPIO_SPEED_FREQ_MEDIUM     0x01U
#define GPIO_SPEED_FREQ_HIGH       0x02U
#define GPIO_SPEED_FREQ_VERY_HIGH  0x03U

#define GPIO_PIN_RESET             0U
#define GPIO_PIN_SET               1U

/* --------------------------------------------------------------------------
 * GPIO: HAL2 removed GPIO_InitTypeDef (uses LL_GPIO_InitTypeDef instead).
 * Many shared files use the old HAL GPIO_InitTypeDef for EXTI config etc.
 * -------------------------------------------------------------------------- */
typedef struct {
    uint32_t Pin;
    uint32_t Mode;
    uint32_t Speed;
    uint32_t OutputType;
    uint32_t Pull;
    uint32_t Alternate;
} GPIO_InitTypeDef;
#define GPIO_MODE_IT_RISING          0x10110000U
#define GPIO_MODE_IT_FALLING         0x10210000U
#define GPIO_MODE_IT_RISING_FALLING  0x10310000U

/* --------------------------------------------------------------------------
 * TIM: channel byte offsets used by Betaflight's timer infrastructure.
 * HAL2 removed these #defines (uses enums instead).
 * -------------------------------------------------------------------------- */
#define TIM_CHANNEL_1  0x0000U
#define TIM_CHANNEL_2  0x0004U
#define TIM_CHANNEL_3  0x0008U
#define TIM_CHANNEL_4  0x000CU

/* Interrupt enable bits (old HAL TIM_IT_ names → DIER register bits) */
#define TIM_IT_UPDATE  TIM_DIER_UIE
#define TIM_IT_CC1     TIM_DIER_CC1IE
#define TIM_IT_CC2     TIM_DIER_CC2IE
#define TIM_IT_CC3     TIM_DIER_CC3IE
#define TIM_IT_CC4     TIM_DIER_CC4IE

/* DMA enable bits */
#define TIM_DMA_CC1    TIM_DIER_CC1DE
#define TIM_DMA_CC2    TIM_DIER_CC2DE
#define TIM_DMA_CC3    TIM_DIER_CC3DE
#define TIM_DMA_CC4    TIM_DIER_CC4DE

/* --------------------------------------------------------------------------
 * TIM: HAL2 removed HAL TIM init structs. Stub them for struct declarations.
 * -------------------------------------------------------------------------- */
typedef struct {
    TIM_TypeDef *Instance;
    struct {
        uint32_t Prescaler;
        uint32_t CounterMode;
        uint32_t Period;
        uint32_t ClockDivision;
        uint32_t RepetitionCounter;
    } Init;
} TIM_HandleTypeDef;
#define TIM_COUNTERMODE_UP  LL_TIM_COUNTERMODE_UP
typedef struct {
    uint32_t OCMode; uint32_t Pulse; uint32_t OCPolarity; uint32_t OCNPolarity;
    uint32_t OCFastMode; uint32_t OCIdleState; uint32_t OCNIdleState;
} TIM_OC_InitTypeDef;
typedef struct {
    uint32_t ICPolarity; uint32_t ICSelection; uint32_t ICPrescaler; uint32_t ICFilter;
} TIM_IC_InitTypeDef;
typedef struct {
    uint32_t OCMode; uint32_t OCState; uint32_t OCNState;
    uint32_t CompareValue; uint32_t OCPolarity; uint32_t OCNPolarity;
    uint32_t OCFastMode; uint32_t OCIdleState; uint32_t OCNIdleState;
} LL_TIM_OC_InitTypeDef;
typedef struct {
    uint32_t ICPolarity; uint32_t ICActiveInput; uint32_t ICPrescaler; uint32_t ICFilter;
} LL_TIM_IC_InitTypeDef;
typedef struct {
    uint32_t Prescaler; uint32_t CounterMode; uint32_t Autoreload;
    uint32_t ClockDivision; uint32_t RepetitionCounter;
} LL_TIM_InitTypeDef;
typedef struct { void *Instance; } UART_HandleTypeDef;
/* --------------------------------------------------------------------------
 * USB PCD: HAL2 renames PCD_HandleTypeDef → hal_pcd_handle_t and changes
 * field names. The USB Device Library (usbd_cdc.c) still uses old names.
 * Include the HAL2 PCD header and typedef + map the old field names.
 * -------------------------------------------------------------------------- */
#include "stm32c5xx_hal_pcd.h"
typedef hal_pcd_handle_t PCD_HandleTypeDef;
/* HAL1 field → HAL2 field mappings for PCD handle access in USB library */
#define IN_ep       in_ep
#define OUT_ep      out_ep
#define maxpacket   max_packet
typedef struct { ADC_TypeDef *Instance; } ADC_HandleTypeDef;

/* --------------------------------------------------------------------------
 * Flash: HAL2 completely rewrites flash API. Provide shims mapping old HAL1
 * names used by config_flash.c to the HAL2 equivalents.
 * -------------------------------------------------------------------------- */
#include "stm32c5xx_hal_flash.h"

