betaflight/betaflight/src/platform/STM32/startup/stm32c5xx_hal2_compat.h
typedef struct {
    uint32_t TypeErase;
    uint32_t Banks;
    uint32_t Sector;
    uint32_t NbSectors;
} FLASH_EraseInitTypeDef;
#define FLASH_TYPEERASE_SECTORS 0x02U
#define FLASH_TYPEPROGRAM_QUADWORD 0x03U

/* --------------------------------------------------------------------------
 * LL DMA types: HAL2 removed LL_DMA_InitTypeDef / LL_DMA_Init. Provide
 * a struct with the fields used by bus_spi_hal2.c for DMA staging.
 * -------------------------------------------------------------------------- */
typedef struct {
    uint32_t SrcAddress;
    uint32_t DestAddress;
    uint32_t Direction;
    uint32_t SrcIncMode;
    uint32_t DestIncMode;
    uint32_t SrcDataWidth;
    uint32_t DestDataWidth;
    uint32_t BlkDataLength;
    uint32_t Request;
    uint32_t Priority;
    uint32_t Mode;
    /* Extra fields used by dshot_bitbang H5 path (not stored in registers) */
    uint32_t BlkHWRequest;
    uint32_t SrcBurstLength;
    uint32_t DestBurstLength;
    uint32_t DataAlignment;
} LL_DMA_InitTypeDef;

static inline void LL_DMA_StructInit(LL_DMA_InitTypeDef *init)
{
    *init = (LL_DMA_InitTypeDef){ 0 };
}

/* --------------------------------------------------------------------------
 * HAL DMA handle: stub for headers that reference DMA_HandleTypeDef.
 * -------------------------------------------------------------------------- */
typedef struct {
    DMA_Channel_TypeDef *Instance;
} DMA_HandleTypeDef;

/* --------------------------------------------------------------------------
 * LL DMA API name changes: HAL2 renamed many LL DMA constants.
 * -------------------------------------------------------------------------- */
#define LL_DMA_NORMAL                   0x00000000U
#define LL_DMA_DATA_ALIGN_ZEROPADD      0x00000000U  /* HAL2 removed alignment control */
#define LL_DMA_SRC_DATAWIDTH_BYTE       LL_DMA_SRC_DATA_WIDTH_BYTE
#define LL_DMA_SRC_DATAWIDTH_HALFWORD   LL_DMA_SRC_DATA_WIDTH_HALFWORD
#define LL_DMA_SRC_DATAWIDTH_WORD       LL_DMA_SRC_DATA_WIDTH_WORD
#define LL_DMA_DEST_DATAWIDTH_BYTE      LL_DMA_DEST_DATA_WIDTH_BYTE
#define LL_DMA_DEST_DATAWIDTH_HALFWORD  LL_DMA_DEST_DATA_WIDTH_HALFWORD
#define LL_DMA_DEST_DATAWIDTH_WORD      LL_DMA_DEST_DATA_WIDTH_WORD
#define LL_DMA_SRC_FIXED                LL_DMA_SRC_ADDR_FIXED
#define LL_DMA_SRC_INCREMENT            LL_DMA_SRC_ADDR_INCREMENTED
#define LL_DMA_DEST_FIXED               LL_DMA_DEST_ADDR_FIXED
#define LL_DMA_DEST_INCREMENT           LL_DMA_DEST_ADDR_INCREMENTED
#define LL_DMA_HWREQUEST_SINGLEBURST    LL_DMA_HARDWARE_REQUEST_BURST
#define LL_DMA_LOW_PRIORITY_LOW_WEIGHT  LL_DMA_PRIORITY_LOW_WEIGHT_MID
#define LL_DMA_LOW_PRIORITY_HIGH_WEIGHT LL_DMA_PRIORITY_LOW_WEIGHT_HIGH
#define LL_DMA_HIGH_PRIORITY            LL_DMA_PRIORITY_HIGH

/* --------------------------------------------------------------------------
 * TIM HAL constants: HAL2 renames many timer defines.
 * -------------------------------------------------------------------------- */
#define TIM_CCx_ENABLE                  LL_TIM_CHANNEL_CH1  /* placeholder for CC enable */
#define TIM_CCx_DISABLE                 0x0000U
#define TIM_ICPOLARITY_RISING           LL_TIM_IC_POLARITY_RISING
#define TIM_ICPOLARITY_FALLING          LL_TIM_IC_POLARITY_FALLING
#define TIM_ICPSC_DIV1                  LL_TIM_ICPSC_DIV1
#define TIM_ICSELECTION_DIRECTTI        LL_TIM_ACTIVEINPUT_DIRECT
#define TIM_OCMODE_PWM1                 LL_TIM_OCMODE_PWM1
#define TIM_OCPOLARITY_HIGH             LL_TIM_OCPOLARITY_HIGH
#define TIM_OCPOLARITY_LOW              LL_TIM_OCPOLARITY_LOW
#define TIM_OCNPOLARITY_HIGH            LL_TIM_OCPOLARITY_HIGH
#define TIM_OCNPOLARITY_LOW             LL_TIM_OCPOLARITY_LOW
#define TIM_OCIDLESTATE_SET             LL_TIM_OCIDLESTATE_SET
#define TIM_OCNIDLESTATE_SET            LL_TIM_OCIDLESTATE_SET
#define TIM_OCFAST_DISABLE              0x00000000U
#define TIM_AUTORELOAD_PRELOAD_ENABLE   TIM_CR1_ARPE

/* HAL2 renamed OC idle state constants: LOW→RESET, HIGH→SET */
#define LL_TIM_OCIDLESTATE_LOW          LL_TIM_OCIDLESTATE_RESET
#define LL_TIM_OCIDLESTATE_HIGH         LL_TIM_OCIDLESTATE_SET

/* HAL2 renamed IC polarity: BOTHEDGE→RISING_FALLING */
#define LL_TIM_IC_POLARITY_BOTHEDGE     LL_TIM_IC_POLARITY_RISING_FALLING

/* DMA burst source: H5 uses LL_TIM_DMA_UPDATE, C5 uses LL_TIM_DMABURST_UPD */
#define LL_TIM_DMA_UPDATE               LL_TIM_DMABURST_UPD

/* --------------------------------------------------------------------------
 * LL TIM Init functions: HAL2 removed LL_TIM_Init / OC_Init / IC_Init.
 * Provide inline implementations using the individual LL setters that
 * DO exist in C5 HAL2.  Used by dshot and pwm_output drivers.
 * -------------------------------------------------------------------------- */
static inline void LL_TIM_StructInit(LL_TIM_InitTypeDef *init)
{
    init->Prescaler = 0;
    init->CounterMode = LL_TIM_COUNTERMODE_UP;
    init->Autoreload = 0xFFFFFFFFU;
    init->ClockDivision = LL_TIM_CLOCKDIVISION_DIV1;
    init->RepetitionCounter = 0;
}

static inline void LL_TIM_Init(TIM_TypeDef *tim, LL_TIM_InitTypeDef *init)
{
    LL_TIM_SetPrescaler(tim, init->Prescaler);
    LL_TIM_SetAutoReload(tim, init->Autoreload);
    LL_TIM_SetCounterMode(tim, init->CounterMode);
    LL_TIM_SetClockDivision(tim, init->ClockDivision);
    LL_TIM_SetRepetitionCounter(tim, init->RepetitionCounter);
    LL_TIM_GenerateEvent_UPDATE(tim);
}

static inline void LL_TIM_OC_StructInit(LL_TIM_OC_InitTypeDef *init)
{
    init->OCMode = LL_TIM_OCMODE_FROZEN;
    init->OCState = LL_TIM_OCSTATE_DISABLE;
    init->OCNState = 0;
    init->CompareValue = 0;
    init->OCPolarity = LL_TIM_OCPOLARITY_HIGH;
    init->OCNPolarity = LL_TIM_OCPOLARITY_HIGH;
    init->OCIdleState = LL_TIM_OCIDLESTATE_RESET;
    init->OCNIdleState = LL_TIM_OCIDLESTATE_RESET;
}

static inline void LL_TIM_OC_Init(TIM_TypeDef *tim, uint32_t channel,
                                  LL_TIM_OC_InitTypeDef *init)
{
    LL_TIM_OC_SetMode(tim, channel, init->OCMode);
    LL_TIM_OC_SetPolarity(tim, channel, init->OCPolarity);
    LL_TIM_OC_SetIdleState(tim, channel, init->OCIdleState);

