betaflight/betaflight/src/platform/STM32/startup/stm32c5xx_hal2_compat.h
    /* Set compare value for the appropriate channel */
    switch (channel) {
    case LL_TIM_CHANNEL_CH1: LL_TIM_OC_SetCompareCH1(tim, init->CompareValue); break;
    case LL_TIM_CHANNEL_CH2: LL_TIM_OC_SetCompareCH2(tim, init->CompareValue); break;
    case LL_TIM_CHANNEL_CH3: LL_TIM_OC_SetCompareCH3(tim, init->CompareValue); break;
    case LL_TIM_CHANNEL_CH4: LL_TIM_OC_SetCompareCH4(tim, init->CompareValue); break;
    default: break;
    }

    /* Enable/disable channel in CCER */
    if (init->OCState == LL_TIM_OCSTATE_ENABLE) {
        LL_TIM_CC_EnableChannel(tim, channel);
    }
}

static inline void LL_TIM_IC_StructInit(LL_TIM_IC_InitTypeDef *init)
{
    init->ICPolarity = LL_TIM_IC_POLARITY_RISING;
    init->ICActiveInput = LL_TIM_ACTIVEINPUT_DIRECT;
    init->ICPrescaler = LL_TIM_ICPSC_DIV1;
    init->ICFilter = LL_TIM_IC_FILTER_FDIV1;
}

static inline void LL_TIM_IC_Init(TIM_TypeDef *tim, uint32_t channel,
                                  LL_TIM_IC_InitTypeDef *init)
{
    /* C5 HAL2 IC functions use shifted encoding (LL_TIM_IC_CONFIG_POS=16).
     * Use the individual LL setter functions which handle the shift. */
    LL_TIM_IC_SetActiveInput(tim, channel, init->ICActiveInput);
    LL_TIM_IC_SetPrescaler(tim, channel, init->ICPrescaler);
    LL_TIM_IC_SetFilter(tim, channel, init->ICFilter);
    LL_TIM_IC_SetPolarity(tim, channel, init->ICPolarity);
}

/* --------------------------------------------------------------------------
 * Flash: HAL2 lock/unlock uses HAL_FLASH_ITF_Unlock/Lock(instance).
 * Program uses HAL_FLASH_ProgramByAddr, erase uses HAL_FLASH_ErasePage.
 * -------------------------------------------------------------------------- */
#define FLASH_BANK_1  HAL_FLASH_BANK_1
#define FLASH_BANK_2  HAL_FLASH_BANK_2

extern hal_flash_handle_t hflash_compat;

static inline HAL_StatusTypeDef HAL_FLASH_Unlock(void)
{
    if (hflash_compat.global_state == 0) {
        HAL_FLASH_Init(&hflash_compat, HAL_FLASH);
    }
    return HAL_FLASH_ITF_Unlock(HAL_FLASH);
}

static inline HAL_StatusTypeDef HAL_FLASH_Lock(void)
{
    return HAL_FLASH_ITF_Lock(HAL_FLASH);
}

static inline HAL_StatusTypeDef HAL_FLASH_Program(uint32_t typeProgram,
                                                  uint32_t address,
                                                  uint32_t dataAddress)
{
    (void)typeProgram;
    return HAL_FLASH_ProgramByAddr(&hflash_compat, address,
                                   (const uint32_t *)dataAddress,
                                   16, /* quad-word = 128 bits = 16 bytes */
                                   5000);
}

static inline HAL_StatusTypeDef HAL_FLASHEx_Erase(FLASH_EraseInitTypeDef *pEraseInit,
                                                  uint32_t *pSectorError)
{
    (void)pSectorError;
    hal_flash_bank_t bank = (pEraseInit->Banks == FLASH_BANK_1)
                            ? HAL_FLASH_BANK_1 : HAL_FLASH_BANK_2;
    return HAL_FLASH_ErasePage(&hflash_compat, bank,
                               pEraseInit->Sector,
                               pEraseInit->NbSectors,
                               5000);
}

/* --------------------------------------------------------------------------
 * TIM HAL function renames: HAL2 simplifies TIM API.
 * -------------------------------------------------------------------------- */
#define HAL_TIM_Base_Start(htim)            do { (void)(htim); } while(0)
#define HAL_TIM_PWM_Start(htim, ch)         do { (void)(htim); (void)(ch); } while(0)
#define HAL_TIMEx_PWMN_Start(htim, ch)      do { (void)(htim); (void)(ch); } while(0)
#define HAL_TIM_PWM_ConfigChannel(htim, cfg, ch)  do { (void)(htim); (void)(cfg); (void)(ch); } while(0)
#define HAL_TIM_IC_ConfigChannel(htim, cfg, ch)   do { (void)(htim); (void)(cfg); (void)(ch); } while(0)
#define HAL_TIM_IC_Start_IT(htim, ch)       do { (void)(htim); (void)(ch); } while(0)
#define TIM_CCxChannelCmd(TIMx, ch, state)  do { (void)(TIMx); (void)(ch); (void)(state); } while(0)

/* Note: HAL2 TIM API is incompatible with old HAL_TIM_Base_Init/Start_IT/IRQHandler.
 * CDC interface timer handling uses LL TIM directly for C5 — see usbd_cdc_interface.c. */

/* --------------------------------------------------------------------------
 * ErrorStatus: HAL2 removed this CMSIS typedef.  LL_USART_Init returns it.
 * -------------------------------------------------------------------------- */
#ifndef __ERRORSTATUS_DEFINED
#define __ERRORSTATUS_DEFINED
typedef enum { ERROR = 0, SUCCESS = !ERROR } ErrorStatus;
#endif

/* --------------------------------------------------------------------------
 * USART LL: HAL2 renames TXE/RXNE flag and interrupt functions to
 * combined FIFO-aware names. Map old names used by serial_uart_ll.c.
 * -------------------------------------------------------------------------- */
#define LL_USART_EnableIT_TXE       LL_USART_EnableIT_TXE_TXFNF
#define LL_USART_IsEnabledIT_TXE    LL_USART_IsEnabledIT_TXE_TXFNF
#define LL_USART_IsActiveFlag_TXE   LL_USART_IsActiveFlag_TXE_TXFNF
#define LL_USART_IsEnabledIT_RXNE   LL_USART_IsEnabledIT_RXNE_RXFNE
#define LL_USART_IsActiveFlag_RXNE  LL_USART_IsActiveFlag_RXNE_RXFNE

/* USART constant renames */
#define LL_USART_DATAWIDTH_8B       LL_USART_DATAWIDTH_8_BIT
#define LL_USART_DATAWIDTH_9B       LL_USART_DATAWIDTH_9_BIT
#define LL_USART_STOPBITS_1         LL_USART_STOP_BIT_1
#define LL_USART_STOPBITS_2         LL_USART_STOP_BIT_2

/* --------------------------------------------------------------------------
 * USART LL: HAL2 removed LL_USART_InitTypeDef / Init / StructInit / DeInit.
 * Provide lightweight implementations using the individual LL setters.
 * -------------------------------------------------------------------------- */
typedef struct {
    uint32_t BaudRate;
    uint32_t DataWidth;
    uint32_t StopBits;
    uint32_t Parity;
    uint32_t TransferDirection;
    uint32_t HardwareFlowControl;
    uint32_t OverSampling;
    uint32_t PrescalerValue;
} LL_USART_InitTypeDef;

static inline void LL_USART_StructInit(LL_USART_InitTypeDef *init)
{
    init->BaudRate            = 9600U;
    init->DataWidth           = LL_USART_DATAWIDTH_8_BIT;
    init->StopBits            = LL_USART_STOP_BIT_1;
    init->Parity              = LL_USART_PARITY_NONE;
    init->TransferDirection   = LL_USART_DIRECTION_TX_RX;
    init->HardwareFlowControl = LL_USART_HWCONTROL_NONE;
    init->OverSampling        = LL_USART_OVERSAMPLING_16;
    init->PrescalerValue      = LL_USART_PRESCALER_DIV1;
}

static inline ErrorStatus LL_USART_Init(USART_TypeDef *USARTx,
                                        const LL_USART_InitTypeDef *init)
{
    LL_USART_SetDataWidth(USARTx, init->DataWidth);
    LL_USART_SetParity(USARTx, init->Parity);
    LL_USART_SetStopBitsLength(USARTx, init->StopBits);
    LL_USART_SetTransferDirection(USARTx, init->TransferDirection);
    LL_USART_SetHWFlowCtrl(USARTx, init->HardwareFlowControl);
    LL_USART_SetOverSampling(USARTx, init->OverSampling);
    LL_USART_SetPrescaler(USARTx, init->PrescalerValue);

    uint32_t periphclk = ((uintptr_t)USARTx >= APB2PERIPH_BASE)
                         ? HAL_RCC_GetPCLK2Freq()
                         : HAL_RCC_GetPCLK1Freq();
    LL_USART_SetBaudRate(USARTx, periphclk, init->PrescalerValue,
                         init->OverSampling, init->BaudRate);

    return (USARTx->BRR != 0U) ? SUCCESS : ERROR;
}

static inline void LL_USART_DeInit(USART_TypeDef *USARTx)
{
    USARTx->CR1 = 0U;
    USARTx->CR2 = 0U;
    USARTx->CR3 = 0U;
    USARTx->BRR = 0U;
}

/* --------------------------------------------------------------------------
 * NVIC priority grouping: HAL2 drops the HAL wrappers, use CMSIS directly.
 * The old NVIC_PRIORITYGROUP_2 = 0x05 maps to 2 bits preemption / 2 bits sub.
 * -------------------------------------------------------------------------- */
#define HAL_NVIC_SetPriorityGrouping  NVIC_SetPriorityGrouping
#define HAL_NVIC_EnableIRQ            NVIC_EnableIRQ
#define HAL_NVIC_DisableIRQ           NVIC_DisableIRQ

