betaflight/betaflight/src/platform/STM32/startup/stm32c5xx_hal2_compat.h
// HAL_NVIC_SetPriority(irq, preempt, sub) → NVIC_SetPriority(irq, encoded)
#define HAL_NVIC_SetPriority(irq, preempt, sub) \
    NVIC_SetPriority((irq), NVIC_EncodePriority(NVIC_GetPriorityGrouping(), (preempt), (sub)))

// HAL2 HAL_GPIO_Init has a different signature (3 args). Redirect old 2-arg
// calls to a no-op so shared code compiles. Actual GPIO config uses LL.
static inline void HAL_GPIO_Init_stub_(void *a __attribute__((unused)), void *b __attribute__((unused))) {}
#define HAL_GPIO_Init(gpio, initptr) HAL_GPIO_Init_stub_((void*)(gpio), (void*)(initptr))

#ifndef NVIC_PRIORITYGROUP_2
#define NVIC_PRIORITYGROUP_2  ((uint32_t)0x00000005)
#endif

/* --------------------------------------------------------------------------
 * HAL RCC: HAL2 renames DeInit.
 * -------------------------------------------------------------------------- */
#define HAL_RCC_DeInit()           HAL_RCC_Reset()
#define HAL_RCC_GetSysClockFreq()  HAL_RCC_GetHCLKFreq()

/* --------------------------------------------------------------------------
 * HAL PWR: backup access control.
 * -------------------------------------------------------------------------- */
#define HAL_PWR_EnableBkUpAccess() ((void)0)  /* C5: backup regs accessible without enable */
#define __HAL_RCC_PWR_CLK_ENABLE() ((void)0)

/* --------------------------------------------------------------------------
 * HAL RCC GPIO/USB clock: HAL2 renames macro-style to function-style.
 * -------------------------------------------------------------------------- */
#define __HAL_RCC_GPIOA_CLK_ENABLE()  HAL_RCC_GPIOA_EnableClock()
#define __HAL_RCC_USB_CLK_ENABLE()    HAL_RCC_USB_EnableClock()
#define __HAL_RCC_USB_CLK_DISABLE()   HAL_RCC_USB_DisableClock()
#define __HAL_RCC_TIM7_CLK_ENABLE()   HAL_RCC_TIM7_EnableClock()

/* --------------------------------------------------------------------------
 * ADC calibration constants: map generic names to C5 LL_ADC_* addresses.
 * -------------------------------------------------------------------------- */
#define VREFINT_CAL_ADDR            ((const uint16_t *)(0x08FFF810UL))
#define VREFINT_CAL_VREF            (3300UL)
#define TEMPSENSOR_CAL1_ADDR        ((const uint16_t *)(0x08FFF814UL))
#define TEMPSENSOR_CAL2_ADDR        ((const uint16_t *)(0x08FFF818UL))
#define TEMPSENSOR_CAL1_TEMP        ((int32_t) 30)
#define TEMPSENSOR_CAL2_TEMP        ((int32_t)140)
#define TEMPSENSOR_CAL_VREFANALOG   (3300UL)

/* --------------------------------------------------------------------------
 * IRQ names: HAL2 renames some timer update IRQ vectors.
 * -------------------------------------------------------------------------- */
#define TIM1_UP_IRQn   TIM1_UPD_IRQn
#define TIM8_UP_IRQn   TIM8_UPD_IRQn

/* --------------------------------------------------------------------------
 * GPIO AF: HAL2 renames GPIO_AFx_TIMy → HAL_GPIO_AFx_TIMy.
 * -------------------------------------------------------------------------- */
#define GPIO_AF1_TIM1    HAL_GPIO_AF1_TIM1
#define GPIO_AF1_TIM2    HAL_GPIO_AF1_TIM2
#define GPIO_AF1_TIM17   HAL_GPIO_AF1_TIM17
#define GPIO_AF2_TIM1    HAL_GPIO_AF2_TIM1
#define GPIO_AF2_TIM3    HAL_GPIO_AF2_TIM3
#define GPIO_AF2_TIM4    HAL_GPIO_AF2_TIM4
#define GPIO_AF2_TIM5    HAL_GPIO_AF2_TIM5
#define GPIO_AF2_TIM8    HAL_GPIO_AF2_TIM8
#define GPIO_AF2_TIM12   HAL_GPIO_AF2_TIM12
#define GPIO_AF2_TIM15   HAL_GPIO_AF2_TIM15
#define GPIO_AF3_TIM1    HAL_GPIO_AF3_TIM1
#define GPIO_AF3_TIM5    HAL_GPIO_AF3_TIM5
#define GPIO_AF3_TIM8    HAL_GPIO_AF3_TIM8
#define GPIO_AF4_TIM15   HAL_GPIO_AF4_TIM15
#define GPIO_AF8_TIM5    HAL_GPIO_AF8_TIM5
#define GPIO_AF10_TIM16  HAL_GPIO_AF10_TIM16
#define GPIO_AF13_TIM8   HAL_GPIO_AF13_TIM8
#define GPIO_AF14_TIM2   HAL_GPIO_AF14_TIM2

/* --------------------------------------------------------------------------
 * DMA: C5 has LPDMA (not GPDMA). Map H5 GPDMA names to C5 LPDMA equivalents
 * so the shared timer_def.h compiles for both.  HAL2 also renames CH→CC and
 * UP→UPD in the DMA request constants.
 * -------------------------------------------------------------------------- */

/* DMA channel instances: GPDMA1_Channelx → LPDMA1_CHx */
#define GPDMA1_Channel0  LPDMA1_CH0
#define GPDMA1_Channel1  LPDMA1_CH1
#define GPDMA1_Channel2  LPDMA1_CH2
#define GPDMA1_Channel3  LPDMA1_CH3
#define GPDMA1_Channel4  LPDMA1_CH4
#define GPDMA1_Channel5  LPDMA1_CH5
#define GPDMA1_Channel6  LPDMA1_CH6
#define GPDMA1_Channel7  LPDMA1_CH7

/* DMA channel IRQ handlers */
#define GPDMA1_CH0_HANDLER  LPDMA1_CH0_HANDLER
#define GPDMA1_CH1_HANDLER  LPDMA1_CH1_HANDLER
#define GPDMA1_CH2_HANDLER  LPDMA1_CH2_HANDLER
#define GPDMA1_CH3_HANDLER  LPDMA1_CH3_HANDLER
#define GPDMA1_CH4_HANDLER  LPDMA1_CH4_HANDLER
#define GPDMA1_CH5_HANDLER  LPDMA1_CH5_HANDLER
#define GPDMA1_CH6_HANDLER  LPDMA1_CH6_HANDLER
#define GPDMA1_CH7_HANDLER  LPDMA1_CH7_HANDLER

/* DMA timer request IDs: GPDMA1→LPDMA1, CHx→CCx, UP→UPD */
#define LL_GPDMA1_REQUEST_TIM1_CH1   LL_LPDMA1_REQUEST_TIM1_CC1
#define LL_GPDMA1_REQUEST_TIM1_CH2   LL_LPDMA1_REQUEST_TIM1_CC2
#define LL_GPDMA1_REQUEST_TIM1_CH3   LL_LPDMA1_REQUEST_TIM1_CC3
#define LL_GPDMA1_REQUEST_TIM1_CH4   LL_LPDMA1_REQUEST_TIM1_CC4
#define LL_GPDMA1_REQUEST_TIM1_UP    LL_LPDMA1_REQUEST_TIM1_UPD
#define LL_GPDMA1_REQUEST_TIM2_CH1   LL_LPDMA1_REQUEST_TIM2_CC1
#define LL_GPDMA1_REQUEST_TIM2_CH2   LL_LPDMA1_REQUEST_TIM2_CC2
#define LL_GPDMA1_REQUEST_TIM2_CH3   LL_LPDMA1_REQUEST_TIM2_CC3
#define LL_GPDMA1_REQUEST_TIM2_CH4   LL_LPDMA1_REQUEST_TIM2_CC4
#define LL_GPDMA1_REQUEST_TIM2_UP    LL_LPDMA1_REQUEST_TIM2_UPD
#define LL_GPDMA1_REQUEST_TIM3_CH1   LL_LPDMA1_REQUEST_TIM3_CC1
#define LL_GPDMA1_REQUEST_TIM3_CH2   LL_LPDMA1_REQUEST_TIM3_CC2
#define LL_GPDMA1_REQUEST_TIM3_CH3   LL_LPDMA1_REQUEST_TIM3_CC3
#define LL_GPDMA1_REQUEST_TIM3_CH4   LL_LPDMA1_REQUEST_TIM3_CC4
#define LL_GPDMA1_REQUEST_TIM3_UP    LL_LPDMA1_REQUEST_TIM3_UPD
#define LL_GPDMA1_REQUEST_TIM4_CH1   LL_LPDMA1_REQUEST_TIM4_CC1
#define LL_GPDMA1_REQUEST_TIM4_CH2   LL_LPDMA1_REQUEST_TIM4_CC2
#define LL_GPDMA1_REQUEST_TIM4_CH3   LL_LPDMA1_REQUEST_TIM4_CC3
#define LL_GPDMA1_REQUEST_TIM4_CH4   LL_LPDMA1_REQUEST_TIM4_CC4
#define LL_GPDMA1_REQUEST_TIM4_UP    LL_LPDMA1_REQUEST_TIM4_UPD
#define LL_GPDMA1_REQUEST_TIM5_CH1   LL_LPDMA1_REQUEST_TIM5_CC1
#define LL_GPDMA1_REQUEST_TIM5_CH2   LL_LPDMA1_REQUEST_TIM5_CC2
#define LL_GPDMA1_REQUEST_TIM5_CH3   LL_LPDMA1_REQUEST_TIM5_CC3
#define LL_GPDMA1_REQUEST_TIM5_CH4   LL_LPDMA1_REQUEST_TIM5_CC4
#define LL_GPDMA1_REQUEST_TIM5_UP    LL_LPDMA1_REQUEST_TIM5_UPD
#define LL_GPDMA1_REQUEST_TIM6_UP    LL_LPDMA1_REQUEST_TIM6_UPD
#define LL_GPDMA1_REQUEST_TIM7_UP    LL_LPDMA1_REQUEST_TIM7_UPD
#define LL_GPDMA1_REQUEST_TIM8_CH1   LL_LPDMA1_REQUEST_TIM8_CC1
#define LL_GPDMA1_REQUEST_TIM8_CH2   LL_LPDMA1_REQUEST_TIM8_CC2
#define LL_GPDMA1_REQUEST_TIM8_CH3   LL_LPDMA1_REQUEST_TIM8_CC3
#define LL_GPDMA1_REQUEST_TIM8_CH4   LL_LPDMA1_REQUEST_TIM8_CC4
#define LL_GPDMA1_REQUEST_TIM8_UP    LL_LPDMA1_REQUEST_TIM8_UPD
#define LL_GPDMA1_REQUEST_TIM15_CH1  LL_LPDMA1_REQUEST_TIM15_CC1
#define LL_GPDMA1_REQUEST_TIM15_CH2  LL_LPDMA1_REQUEST_TIM15_CC2
#define LL_GPDMA1_REQUEST_TIM15_UP   LL_LPDMA1_REQUEST_TIM15_UPD
#define LL_GPDMA1_REQUEST_TIM16_CH1  LL_LPDMA1_REQUEST_TIM16_CC1
#define LL_GPDMA1_REQUEST_TIM16_UP   LL_LPDMA1_REQUEST_TIM16_UPD
#define LL_GPDMA1_REQUEST_TIM17_CH1  LL_LPDMA1_REQUEST_TIM17_CC1
#define LL_GPDMA1_REQUEST_TIM17_UP   LL_LPDMA1_REQUEST_TIM17_UPD

/* --------------------------------------------------------------------------
 * SPI LL: HAL2 renames many LL_SPI constants.
 * -------------------------------------------------------------------------- */
#define LL_SPI_BAUDRATEPRESCALER_DIV2    LL_SPI_BAUD_RATE_PRESCALER_2
#define LL_SPI_BAUDRATEPRESCALER_DIV4    LL_SPI_BAUD_RATE_PRESCALER_4
#define LL_SPI_BAUDRATEPRESCALER_DIV8    LL_SPI_BAUD_RATE_PRESCALER_8
#define LL_SPI_BAUDRATEPRESCALER_DIV16   LL_SPI_BAUD_RATE_PRESCALER_16
#define LL_SPI_BAUDRATEPRESCALER_DIV32   LL_SPI_BAUD_RATE_PRESCALER_32
#define LL_SPI_BAUDRATEPRESCALER_DIV64   LL_SPI_BAUD_RATE_PRESCALER_64
#define LL_SPI_BAUDRATEPRESCALER_DIV128  LL_SPI_BAUD_RATE_PRESCALER_128
#define LL_SPI_BAUDRATEPRESCALER_DIV256  LL_SPI_BAUD_RATE_PRESCALER_256

#define LL_SPI_DATAWIDTH_8BIT            LL_SPI_DATA_WIDTH_8_BIT

