betaflight/betaflight/src/platform/STM32/startup/stm32c5xx_hal2_compat.h
#define LL_SPI_PHASE_1EDGE               LL_SPI_CLOCK_PHASE_1_EDGE
#define LL_SPI_PHASE_2EDGE               LL_SPI_CLOCK_PHASE_2_EDGE
#define LL_SPI_POLARITY_LOW              LL_SPI_CLOCK_POLARITY_LOW
#define LL_SPI_POLARITY_HIGH             LL_SPI_CLOCK_POLARITY_HIGH

#define LL_SPI_FIFO_TH_01DATA           LL_SPI_FIFO_THRESHOLD_1_DATA

#define LL_SPI_CRCCALCULATION_DISABLE    0x00000000U

/* SPI LL: HAL2 renamed LL_SPI_SetBitOrder → LL_SPI_SetTransferBitOrder */
#define LL_SPI_SetBitOrder               LL_SPI_SetTransferBitOrder

/* SPI LL: HAL2 removed LL_SPI_InitTypeDef / Init / DeInit. Provide
 * lightweight implementations using the individual LL setters. */
typedef struct {
    uint32_t TransferDirection;
    uint32_t Mode;
    uint32_t DataWidth;
    uint32_t ClockPolarity;
    uint32_t ClockPhase;
    uint32_t NSS;
    uint32_t BaudRate;
    uint32_t BitOrder;
    uint32_t CRCCalculation;
    uint32_t CRCPoly;
} LL_SPI_InitTypeDef;

static inline ErrorStatus LL_SPI_Init(SPI_TypeDef *SPIx,
                                      const LL_SPI_InitTypeDef *init)
{
    // Use LL_SPI_SetConfig (the HAL2 path) so SSI is armed BEFORE
    // CFG2.MASTER is written. The previous per-setter sequence wrote
    // MASTER first (via LL_SPI_SetMode) with SSM still 0, which on
    // STM32C5 silicon raises MODF and atomically clears MASTER if
    // the hardware NSS pin happened to read low. The downstream
    // "re-arm MASTER" in bus_spi_hal2.c then runs on a peripheral
    // that's already in slave mode with stale state, and the next
    // transfer drives no SCK on the pad even though EOT asserts.
    LL_SPI_SetConfig(SPIx,
                     init->DataWidth | init->BaudRate,
                     init->Mode | init->TransferDirection |
                     init->ClockPolarity | init->ClockPhase |
                     init->BitOrder | init->NSS);
    if (init->CRCCalculation) {
        LL_SPI_EnableCRC(SPIx);
    }
    return SUCCESS;
}

static inline void LL_SPI_DeInit(SPI_TypeDef *SPIx)
{
    SPIx->CR1  = 0U;
    SPIx->CFG1 = 0x00070007U;  /* reset value */
    SPIx->CFG2 = 0U;
    SPIx->IER  = 0U;
    SPIx->IFCR = 0xFFFFFFFFU;  /* clear all flags */
}

/* --------------------------------------------------------------------------
 * GPIO AF: HAL2 renames GPIO_AFx_SPIy → HAL_GPIO_AFx_SPIy.
 * -------------------------------------------------------------------------- */
/* USB AF: C5 uses AF13 for USB (not AF10 like H5) */
#define GPIO_AF10_USB    HAL_GPIO_AF13_USB

#define GPIO_AF5_SPI1    HAL_GPIO_AF5_SPI1
#define GPIO_AF5_SPI2    HAL_GPIO_AF5_SPI2
#define GPIO_AF5_SPI3    HAL_GPIO_AF5_SPI3
#define GPIO_AF6_SPI3    HAL_GPIO_AF6_SPI3
#define GPIO_AF7_SPI3    HAL_GPIO_AF7_SPI3

/* --------------------------------------------------------------------------
 * LL_TIM_DeInit: not available in HAL2 LL. Use HAL version.
 * -------------------------------------------------------------------------- */
#define LL_TIM_DeInit(tim) do { (void)(tim); } while(0)

/* --------------------------------------------------------------------------
 * I2C: IRQ name compat — C5 uses I2Cx_ERR_IRQn, Betaflight expects I2Cx_ER_IRQn.
 * -------------------------------------------------------------------------- */
#define I2C1_ER_IRQn  I2C1_ERR_IRQn
#define I2C2_ER_IRQn  I2C2_ERR_IRQn

/* I2C: GPIO AF compat */
#define GPIO_AF4_I2C1  HAL_GPIO_AF4_I2C1
#define GPIO_AF4_I2C2  HAL_GPIO_AF4_I2C2

/* --------------------------------------------------------------------------
 * LL I2C: HAL2 removed LL_I2C_InitTypeDef / Init / DeInit / StructInit.
 * Provide inline implementations using individual LL setters.
 * -------------------------------------------------------------------------- */
typedef struct {
    uint32_t PeripheralMode;
    uint32_t Timing;
    uint32_t AnalogFilter;
    uint32_t DigitalFilter;
    uint32_t OwnAddress1;
    uint32_t TypeAcknowledge;
    uint32_t OwnAddrSize;
} LL_I2C_InitTypeDef;

static inline void LL_I2C_StructInit(LL_I2C_InitTypeDef *init)
{
    init->PeripheralMode  = LL_I2C_MODE_I2C;
    init->Timing          = 0U;
    init->AnalogFilter    = LL_I2C_ANALOGFILTER_ENABLE;
    init->DigitalFilter   = 0U;
    init->OwnAddress1     = 0U;
    init->TypeAcknowledge = LL_I2C_ACK;
    init->OwnAddrSize     = LL_I2C_OWNADDRESS1_7BIT;
}

static inline ErrorStatus LL_I2C_Init(I2C_TypeDef *I2Cx,
                                      const LL_I2C_InitTypeDef *init)
{
    LL_I2C_Disable(I2Cx);
    LL_I2C_SetMode(I2Cx, init->PeripheralMode);
    LL_I2C_SetTiming(I2Cx, init->Timing);
    if (init->AnalogFilter == LL_I2C_ANALOGFILTER_ENABLE) {
        LL_I2C_EnableAnalogFilter(I2Cx);
    } else {
        LL_I2C_DisableAnalogFilter(I2Cx);
    }
    LL_I2C_SetDigitalFilter(I2Cx, init->DigitalFilter);
    LL_I2C_SetOwnAddress1(I2Cx, init->OwnAddress1, init->OwnAddrSize);
    LL_I2C_AcknowledgeNextData(I2Cx, init->TypeAcknowledge);
    return SUCCESS;
}

static inline ErrorStatus LL_I2C_DeInit(I2C_TypeDef *I2Cx)
{
    LL_I2C_Disable(I2Cx);
    I2Cx->CR1    = 0U;
    I2Cx->CR2    = 0U;
    I2Cx->OAR1   = 0U;
    I2Cx->OAR2   = 0U;
    I2Cx->TIMINGR = 0U;
    return SUCCESS;
}

#endif /* STM32C5XX_HAL2_COMPAT_H */
